## Pengujian Hipotesis Untuk Membuktikan Apakah Education Berpengaruh Terhadap Income Atau Tidak?
HW_Hypothesis Testing Concept_Alvin Christians <br>

Berikut ini adalah daftar isi dari Notebook ini: <br>

1. Data Preparation
2. Descriptive Statistics
3. Hypothesis Testing ANOVA

## <span style='color:Black '> 1. Data Preparation </span>
<img style="float: left;" src="image4.png" width="50"/>

In [ ]:
# Import Library

import pandas as pd
import numpy as np
import scipy.stats as st

In [3]:
# Upload file CSV
df = pd.read_csv('marketing_campaign.csv',delimiter='\t')

In [4]:
# Menampilkan 5 data teratas

df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0

In [5]:
# Check dataframe shape

df.shape

(2240, 29)

In [13]:
# Check apakah terdapat kolom yang memiliki data kosong

df.isnull().any(axis=0)

ID                     False
Year_Birth             False
Education              False
Marital_Status         False
Income                 False
Kidhome                False
Teenhome               False
Dt_Customer            False
Recency                False
MntWines               False
MntFruits              False
MntMeatProducts        False
MntFishProducts        False
MntSweetProducts       False
MntGoldProds           False
NumDealsPurchases      False
NumWebPurchases        False
NumCatalogPurchases    False
NumStorePurchases      False
NumWebVisitsMonth      False
AcceptedCmp3           False
AcceptedCmp4           False
AcceptedCmp5           False
AcceptedCmp1           False
AcceptedCmp2           False
Complain               False
Z_CostContact          False
Z_Revenue              False
Response               False
dtype: bool

In [14]:
# Check jumlah data yang kosong pada kolom Income

df['Income'].isnull().sum()

0       58138.0
1       46344.0
2       71613.0
3       26646.0
4       58293.0
         ...
2235    61223.0
2236    64014.0
2237    56981.0
2238    69245.0
2239    52869.0
Name: Income, Length: 2240, dtype: float64

In [16]:
# Mengisi data yang kosong

df['Income'] = df['Income'].fillna(df['Income'].mean())

In [17]:
# Menampilkan descriptive statistik data

df['Income'].describe()

count      2240.000000
mean      52247.251354
std       25037.797168
min        1730.000000
25%       35538.750000
50%       51741.500000
75%       68289.750000
max      666666.000000
Name: Income, dtype: float64

## <span style='color:Black '> 2. Descriptive Statistics </span>
<img style="float: left;" src="image1.png" width="50"/>

In [25]:
# Mencari Rata-rata Income

mean_income = df['Income'].mean()
print('Mean Of Income : ',mean_income)

Mean Of Income :  52247.25135379059

In [26]:
# Mencari Nilai Tengah Income

median_income = df['Income'].median()
print('Median Of Income : ',median_income)

Median Of Income :  51741.5

In [46]:
# Mencari varian yang ada pada Education

df['Education'].unique()

array(['Graduation', 'PhD', 'Master', 'Basic', '2n Cycle'], dtype=object)

In [40]:
# Mencari jenis Edukasi yang paling banyak keluar

modus_education = df['Education'].mode()[0]
print('Modus Of Education : ',modus_education)

Modus Of Education :  Graduation

## <span style='color:Black '> 3. Hypothesis Testing ANOVA </span>
<img style="float: left;" src="image3.png" width="50"/>

In [43]:
# Check group berdasarkan Education

Education_Income = df.groupby(['Education'])['Income']
Education_Income.describe()

,count,mean,std,min,25%,50%,75%,max
Education,,,,,,,,
2n Cycle,203.0,47701.378099,21961.310186,7500.0,28095.00,46891.000000,65100.5,96547.0
Basic,54.0,20306.259259,6235.066773,7500.0,15405.25,20744.000000,24882.0,34445.0
Graduation,1127.0,52715.755781,28039.260682,1730.0,34925.50,52247.251354,69737.0,666666.0
Master,370.0,52908.476370,20020.901834,6560.0,37853.75,51044.500000,66596.0,157733.0
PhD,486.0,56105.210405,20510.232102,4023.0,40654.25,55005.000000,69084.0,162397.0

In [82]:
dfCycle =df[df['Education'] == '2n Cycle']
dfGraduation = df[df['Education'] == 'Graduation']
dfPhD = df[df['Education'] == 'PhD']
dfMaster = df[df['Education'] == 'Master']
dfBasic = df[df['Education'] == 'Basic']

In [83]:
# Pengujian Untuk Anova

Anova_Test = st.f_oneway(dfCycle['Income'],
                         dfGraduation['Income'],
                         dfPhD['Income'],
                         dfMaster['Income'],
                         dfBasic['Income'])

In [84]:
# Mencari PValue

Hasil_Uji_Anova = Anova_Test.pvalue
print(Hasil_Uji_Anova)

1.0531133036234708e-22

In [86]:
# Hasil Uji Anova

if Hasil_Uji_Anova > 0.05:
  print('Education Tidak Berpengaruh Terhadap Income')
else:
  print('Education Berpengaruh Terhadap Income')

Education Berpengaruh Terhadap Income

In [79]:
# Melihat Rata-Rata Income Dari Masing-Masing Education

df.groupby(['Education'])['Income'].mean()

Education
2n Cycle      47701.378099
Basic         20306.259259
Graduation    52715.755781
Master        52908.476370
PhD           56105.210405
Name: Income, dtype: float64